In [67]:
import pandas as pd
import seaborn as sns
import numpy as np

# Загрузка датасета Titanic
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# C помощью группировки group_by необходимо:

**1. Выживаемость по классу пассажира**

Сгруппируйте данные по pclass (классу) и вычислите среднюю выживаемость (survived) для каждого класса.

In [68]:
titanic.groupby('pclass')['survived'].mean()

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

**2. Распределение возраста по полу**

Сгруппируйте по sex и найдите средний возраст (age) мужчин и женщин. Учтите пропущенные значения.

In [69]:
titanic['age'] = titanic['age'].fillna(titanic['age'].median())
titanic.groupby('sex')['age'].mean()

sex
female    27.929936
male      30.140676
Name: age, dtype: float64

**3. Средняя стоимость билета по классу и порту посадки**

Сгруппируйте по pclass и embarked, затем найдите среднюю цену билета (fare) для каждой группы.

In [70]:
titanic.groupby(['pclass', 'embarked'])['fare'].mean()

pclass  embarked
1       C           104.718529
        Q            90.000000
        S            70.364862
2       C            25.358335
        Q            12.350000
        S            20.327439
3       C            11.214083
        Q            11.183393
        S            14.644083
Name: fare, dtype: float64

**4. Выживаемость детей vs взрослых**

Создайте колонку AgeGroup (например, "Child" для возраста < 18 и "Adult" для ≥ 18), затем сгруппируйте по ней и посчитайте количество выживших.

In [71]:
titanic['ageGroup'] = ['child' if x < 18 else 'adult' for x in titanic['age']]
titanic.groupby('ageGroup')['survived'].sum()

ageGroup
adult    281
child     61
Name: survived, dtype: int64

**5. Количество родственников на борту**

Сгруппируйте по сумме sibsp (братья/сестры/супруги) и parch (родители/дети), создав колонку FamilySize, и определите среднюю выживаемость для каждого размера семьи.

In [72]:
titanic.groupby(['sibsp','parch'])['survived'].mean()

sibsp  parch
0      0        0.303538
       1        0.657895
       2        0.724138
       3        1.000000
       4        0.000000
       5        0.000000
1      0        0.520325
       1        0.596491
       2        0.631579
       3        0.333333
       4        0.000000
       5        0.333333
       6        0.000000
2      0        0.250000
       1        0.857143
       2        0.500000
       3        1.000000
3      0        1.000000
       1        0.000000
       2        0.285714
4      1        0.000000
       2        0.333333
5      2        0.000000
8      2        0.000000
Name: survived, dtype: float64

**6. Распределение пассажиров по порту посадки и классу**

Сгруппируйте по embarked и pclass, затем посчитайте общее количество пассажиров в каждой группе.

In [73]:
titanic.groupby(['embarked','pclass']).size()

embarked  pclass
C         1          85
          2          17
          3          66
Q         1           2
          2           3
          3          72
S         1         127
          2         164
          3         353
dtype: int64

**7. Максимальный возраст выживших/погибших в каждом классе**

Сгруппируйте по pclass и survived, затем найдите максимальный возраст (age) в каждой категории.

In [74]:
titanic.groupby(['pclass','survived']).agg({'pclass': 'sum'})

                 pclass
pclass survived
1      0             80
       1            136
2      0            194
       1            174
3      0           1116
       1            357

**8. Выживаемость одиночек vs семейных**
Создайте колонку IsAlone (True, если sibsp + parch = 0), сгруппируйте по ней и посчитайте среднюю выживаемость.

In [76]:
conditions = [
    (titanic['sibsp'] == 0) & (titanic['parch'] == 0)
    ]
values = ['yes']

titanic['isAlone'] = np.select(conditions, values,  default= 'no')
titanic.groupby('isAlone')['survived'].mean()

isAlone
no     0.505650
yes    0.303538
Name: survived, dtype: float64